<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"d999386b34105054ecb7efc9ac3a34fb139ab038228ecae78019e281c1a2d1c0","plan_job_ref":"Job Terraform plan #42 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8145357045","plan_out_hash":"c1b240828a28dfadea3cb0d4cbbb2eaf076b76c9cc5fade096d5c6bddd90e6e9","plan_hash":"faeb0e41873ebb6b402493cfc358b8bd4b7d869ad15fd79411b104a55cdd9408","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key   = (sensitive value)
deployer_secret_key   = (sensitive value)
docker_api_repository = "movie-recognizer-api"
docker_username       = "aslipatov"
folder_id             = "b1gs3v5tpo5eo8em8ph4"
github_sha            = "fba64d93ca253d2d8fd6ef82bfb530abdd7179ac"
```
</details>
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # yandex_function.receive-video-handler will be updated in-place
!~  resource "yandex_function" "receive-video-handler" {
        id                 = "d4ef136o48bqjg3sv4q7"
        name               = "receive-video-handler"
        tags               = []
!~      user_hash          = "a9ea998f532404976990ca0b81506319b70b6ea867546e84b382466eeca54ec4" -> "e2c936a1fc89944106d15ccec8fbad443c1fb13da75caa22c727a1eac353382f"
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # yandex_iam_service_account.api-sa will be created
+   resource "yandex_iam_service_account" "api-sa" {
+       created_at = (known after apply)
+       folder_id  = (known after apply)
+       id         = (known after apply)
+       name       = "api-sa"
    }

  # yandex_serverless_container.test-container will be created
+   resource "yandex_serverless_container" "test-container" {
+       core_fraction      = (known after apply)
+       cores              = 1
+       created_at         = (known after apply)
+       execution_timeout  = (known after apply)
+       folder_id          = (known after apply)
+       id                 = (known after apply)
+       memory             = 128
+       name               = "api"
+       revision_id        = (known after apply)
+       service_account_id = (known after apply)
+       url                = (known after apply)

+       image {
+           digest = (known after apply)
+           url    = "https://hub.docker.com/r/aslipatov/movie-recognizer-api:fba64d93ca253d2d8fd6ef82bfb530abdd7179ac"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #25](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8145373827)